Tekla Open API Reference for Tekla Structures 2025
PositionTypeEnum Enumeration
 The position type for connections and seams.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PositionTypeEnum
Public Enumeration PositionTypeEnum
Members
Member name | Value | Description
MIDDLE_PLANE | 0 |  The middle plane position type.
BOX_PLANE | 1 |  The box plane position type.
COLLISION_PLANE | 2 |  The collision plane position type.
END_END_PLANE | 3 |  The end plane position type.
GUSSET_PLANE | 4 |  The gusset plane position type.
See Also
Reference
Tekla.Structures Namespace